
. 
. ******************************************************************************** 
. *here we select the list of agreements: based on WTO excel file  (which version?? Ask Alvaro)
. 
. 
. ********************************************************************************
. ********************************************************************************
. /*
> same perimeter but need to keep them in  the sample for clusters
> North American Free Trade Agreement (NAFTA)                    id_agree:  27            Inactive        1994 - 2020 (2019)
> United States-Mexico-Canada Agreement (USMCA/CUSMA/T-MEC)  id_agree: 291                In Force        2020 - 2999 
> 
>  
> A S E A N Free Trade Area (AFTA) - 1992 id_agree:   25   Inactive       1993 - 2010 (2009)
> ASEAN Free Trade Area (AFTA)            id_agree:  295   In Force       2010 - 2999
> */
. ********************************************************************************
. ********************************************************************************
. * we fix here RTA Status: if Active goes into cluster if Inactive goes into "opted_out" (Early & PSA  are dropped they goes into RTA = 0 )
. cd "$DATA/DTA"
/Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/DTA

. import excel "$dataset", sheet("Agreements") firstrow allstring clear // Bilateral information is created using the 0_Agreements_Information_Dec_2023 dofile
(24 vars, 400 obs)

. 
. 
. 
. ********************************************************************************
. * select RTA into the Toolkit
. 
. replace Status                 = "Active"                                                    if  WBID   == "25"   | WBID   == "27"
(2 real changes made)

. // 25: Asean 1992  ; 27 NAFTA 1994. We set both as active they will just change profile when the update versions will entry into force 
. replace Status                 = "Empty_provisions"                                  if  WBID   == "329"         
(1 real change made)

. // 329 Pacific Agreement on Closer Economic Relations Plus (PACER Plus): all provisions are empty not sure how to treat this
. replace Status                 = "Empty_provisions"                                  if  WBID   == "328"
(1 real change made)

. // 328  Morocco - United Arab Emirates : all provisions are empty not sure how to treat this
. 
. // Entry/Exit to be amended:
. replace SpecificEntryExitdates =  "Tuvalu(03-Apr-2022 - ); Vanuatu(10-Oct-2022 - ); "                                           + SpecificEntryExitdates   if 
>  WBID   == "329" 
(1 real change made)

.  // 329 2020    Pacific Agreement on Closer Economic Relations Plus (PACER Plus) :  
.  
. replace SpecificEntryExitdates = "Sudan(01-Apr-2016 - ); Democratic Republic of the Congo(01-Jul-2022 - );" + SpecificEntryExitdates   if  WBID   == "54" 
(1 real change made)

.  // 54  2000 East African Community (EAC)       
.  
.  replace SpecificEntryExitdates = "Angola( - 31-Dec-1997);"                                                                                             + Spec
> ificEntryExitdates   if  WBID   == "29" 
(1 real change made)

. //      29      1994 Common Market for Eastern and Southern Africa (COMESA)
. 
.  replace SpecificEntryExitdates = "Angola(01-Apr-2003 - ); Madagascar(01-Apr-2014 - ); "                                        + SpecificEntryExitdates   if 
>  WBID   == "95" 
(1 real change made)

. //      95 Southern African Development Community (SADC)
. 
.  replace SpecificEntryExitdates = "Afghanistan(01-Jan-1992 - ); Tajikistan(01-Jan-1992 - ) "                        + SpecificEntryExitdates   if  WBID   == "
> 24" 
(1 real change made)

. //      24 Economic Cooperation Organization (ECO)
. 
.  replace SpecificEntryExitdates = "Panama(01-Jan-2012 - ); "                                                                                    + SpecificEntr
> yExitdates   if  WBID   == "15" 
(1 real change made)

. //      15 Latin American Integration Association (LAIA)
. 
.  replace SpecificEntryExitdates = "Palestine(01-Jan-2016 - ); "                                                                                 + SpecificEntr
> yExitdates   if  WBID   == "118" 
(1 real change made)

. //      118 Pan-Arab Free Trade Area (PAFTA)
. 
.  replace SpecificEntryExitdates = "Guinea-Bissau(01-May-1997 - ); "                                                                     + SpecificEntryExitdat
> es   if  WBID   == "50" 
(1 real change made)

. //      50 West African Economic and Monetary Union (WAEMU)
. 
.  replace SpecificEntryExitdates = subinstr(SpecificEntryExitdates, "United Kingdom( - 31-Dec-2020)", "United Kingdom( - 31-Dec-2019);", .)
(53 real changes made)

. // 235 EU (28) Enlargement      (in WTO website UK left 31 January 2020 not 31 December as in the excell file. We set 31 dec 2019 otherwise will be in 2020 tr
> ade data): 53 agreement in total need to be adjusted 
.  
.  replace SpecificEntryExitdates = "United Kingdom( - 31-Dec-2019); "                                                                    + SpecificEntryExitdat
> es   if  WBID   == "230" 
(1 real change made)

. // 230 EU - Central America
. 
.  replace SpecificEntryExitdates = "United Kingdom(01-Jan-1973 - 31-Dec-2019)"                                                                              if 
>  WBID   == "4" 
(1 real change made)

. //      4 EU â€“ Overseas Countries and Territories (OCT) (for consistency)
. 
.  
.                                         drop                                    if  Status == "Early Announcement"  // only EU-MERCOSUR: no record in the WTO 
> database so ok to drop
(1 observation deleted)

. *                                       drop                                    if  Type   =="PSA"                  // 28 agreement to be discussed
. 
. replace Accession               = "Yes"     if  WBID   == "331" |  WBID   == "177" | WBID   == "323" | WBID   == "333"   
(4 real changes made)

. 
. 
. /*
> Southern Common Market (MERCOSUR) - Egypt       331
> Southern Common Market (MERCOSUR) - India       177
> Southern Common Market (MERCOSUR) - Israel      323
> Southern Common Market (MERCOSUR) - Southern African Customs Union (SACU)       333
> *******************************************************************************/
. * Basic data preparation (once for all)
.  
. destring WBID, replace
WBID: all characters numeric; replaced as int

. drop if WBID == .
(0 observations deleted)

. 
. rename DateofEntryintoForceG   entry_force 

. rename InactiveDate            opted_out

. rename WBID                            id_agree

. rename RTAComposition          composition

. rename Accession                   accession

. rename Agreement               agreement

. 
. replace entry_force                = substr(entry_force          , -4, . )
(397 real changes made)

. replace entry_force                = substr(DateofEntryintoForceS, -4, . )              if entry_force == ""
(2 real changes made)

. replace opted_out                          = substr(opted_out            , -4, . )
(16 real changes made)

. 
. 
. destring entry_force               , replace
entry_force: all characters numeric; replaced as int

. destring opted_out                         , replace
opted_out: all characters numeric; replaced as int
(383 missing values generated)

. 
. 
. 
. save  "$TEMP/rta_data_raw.dta", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/rta_data_raw.dta saved

. 
. * 399 RTAs here (only dropped EU-MERCOSUR)
. ********************************************************************************
. ********************************************************************************
. ********************************************************************************
. 
. use  "$TEMP/rta_data_raw.dta", replace

. 
. keep if  Status !="Inactive"
(14 observations deleted)

. 
. 
. keep id_agree entry_force composition accession agreement Currentsignatories Originalsignatories SpecificEntryExitdates   

. 
. 
. 
. replace SpecificEntryExitdates = subinstr(SpecificEntryExitdates, " - )", "\Entry", .)
variable SpecificEntryExitdates was str577 now str619
(51 real changes made)

. replace SpecificEntryExitdates = subinstr(SpecificEntryExitdates, "( - ", "(Exit\", .)
(62 real changes made)

. replace SpecificEntryExitdates = subinstr(SpecificEntryExitdates, "("   , "\"     , .)
(105 real changes made)

. replace SpecificEntryExitdates = subinstr(SpecificEntryExitdates, ")"   , ""      , .)
(64 real changes made)

. 
. 
. split Originalsignatories      , parse(;) gen(original)
variables created as string: 
original1   original5   original9   original13  original17  original21  original25  original29  original33  original37  original41
original2   original6   original10  original14  original18  original22  original26  original30  original34  original38  original42
original3   original7   original11  original15  original19  original23  original27  original31  original35  original39  original43
original4   original8   original12  original16  original20  original24  original28  original32  original36  original40  original44

. split Currentsignatories       , parse(;) gen(current)
variables created as string: 
current1   current5   current9   current13  current17  current21  current25  current29  current33  current37  current41  current45
current2   current6   current10  current14  current18  current22  current26  current30  current34  current38  current42  current46
current3   current7   current11  current15  current19  current23  current27  current31  current35  current39  current43  current47
current4   current8   current12  current16  current20  current24  current28  current32  current36  current40  current44

. split SpecificEntryExitdates   , parse(;) gen(change)
variables created as string: 
change1   change3   change5   change7   change9   change11  change13  change15  change17  change19  change21
change2   change4   change6   change8   change10  change12  change14  change16  change18  change20  change22

. 
. 
. reshape long original  current change, i(agreement id_agree entry_force accession composition) j(id_members)
(j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47)
(variable change23 not found)
(variable change24 not found)
(variable change25 not found)
(variable change26 not found)
(variable change27 not found)
(variable change28 not found)
(variable change29 not found)
(variable change30 not found)
(variable change31 not found)
(variable change32 not found)
(variable change33 not found)
(variable change34 not found)
(variable change35 not found)
(variable change36 not found)
(variable change37 not found)
(variable change38 not found)
(variable change39 not found)
(variable change40 not found)
(variable change41 not found)
(variable change42 not found)
(variable change43 not found)
(variable change44 not found)
(variable original45 not found)
(variable change45 not found)
(variable original46 not found)
(variable change46 not found)
(variable original47 not found)
(variable change47 not found)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations              385   ->   18,095      
Number of variables                 121   ->   12          
j variable (47 values)                    ->   id_members
xij variables:
     original1 original2 ... original47   ->   original
        current1 current2 ... current47   ->   current
           change1 change2 ... change47   ->   change
-----------------------------------------------------------------------------

. 
. drop    if original =="" & current =="" & change ==""
(15,694 observations deleted)

. 
. 
. split   change          , parse(\) gen(change_time)
variables created as string: 
change_time1  change_time2  change_time3

. 
. gen     entry_time  = change_time2                                      if change_time3 =="Entry"
(2,242 missing values generated)

. replace entry_time  = substr(change_time2, 1, 12)    if change_time2 !=""  & change_time3 == ""
variable entry_time was str11 now str12
(5 real changes made)

. 
. gen     exit_time   = change_time3 if change_time2 =="Exit"
(2,326 missing values generated)

. replace exit_time   = substr(change_time2, -12, .)   if change_time2 !=""  & change_time3 == ""
variable exit_time was str11 now str12
(5 real changes made)

. 
. replace entry_time  = subinstr(entry_time, " ", "", .)
(5 real changes made)

. replace exit_time   = subinstr(exit_time, " ", "", .)
(5 real changes made)

. 
. rename change_time1   change_cty  

. 
. cap drop change 

. cap drop change_time2

. cap drop change_time3

. 
. cap drop Originalsignatories

. cap drop Currentsignatories

. cap drop SpecificEntryExitdates

. 
. 
. replace  entry_time = substr(entry_time, -4, .)
(164 real changes made)

. destring entry_time     , replace
entry_time: all characters numeric; replaced as int
(2237 missing values generated)

. 
. 
. replace  exit_time      = substr(exit_time, -4, .)
(80 real changes made)

. destring exit_time      , replace
exit_time: all characters numeric; replaced as int
(2321 missing values generated)

. 
. 
. replace current     = trim(current)
(1,024 real changes made)

. replace original    = trim(original)
(1,948 real changes made)

. replace change_cty  = trim(change_cty)
(0 real changes made)

.  
. 
.  
. ******************************************************************************** 
. * NAFTA in
. replace entry_time  =  1994                 if id_agree == 27 
(3 real changes made)

. replace exit_time   =  2019                 if id_agree == 27  
(3 real changes made)

. replace current     = original          if id_agree == 27 
(3 real changes made)

. replace change_cty  = original          if id_agree == 27 
(3 real changes made)

. 
. 
. * ASEAN in  
. replace entry_time  =  1993                     if id_agree == 25 
(10 real changes made)

. replace exit_time   =  2009                     if id_agree == 25  
(10 real changes made)

. replace current     = original          if id_agree == 25
(10 real changes made)

. replace change_cty  = original          if id_agree == 25 
(10 real changes made)

. replace agreement   = "A S E A N 1992"  if id_agree == 25  // need to change name to avoid confusion with the following ASEAN (perimeters are the same)
(10 real changes made)

. 
.   
. ********************************************************************************  
. 
. rename   exit_time        change_exit_time

. rename   entry_time   change_entry_time 

.   
. preserve

. keep id_agree agreement entry_force accession composition

. duplicates drop

Duplicates in terms of all variables

(2,016 observations deleted)

. save "$TEMP/id_agree_perimeter", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/id_agree_perimeter.dta saved

. restore

. 
. 
. preserve

. keep id_agree current 

. drop if current ==""
(981 observations deleted)

. duplicates drop id_agree current, force  

Duplicates in terms of id_agree current

(0 observations are duplicates)

. 
. save "$TEMP/perimeter", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter.dta saved

. restore

.  
. 
. preserve

. keep   id_agree change_cty change_entry_time change_exit_time

. gen     current = change_cty
(2,149 missing values generated)

. drop if current ==""
(2,149 observations deleted)

. duplicates drop id_agree current, force  

Duplicates in terms of id_agree current

(1 observation deleted)

.  
. merge 1:m id_agree current using "$TEMP/perimeter"
(variable current was str33, now str75 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,423
        from master                       127  (_merge==1)
        from using                      1,296  (_merge==2)

    Matched                               124  (_merge==3)
    -----------------------------------------

. drop _m 

. 
.  
. save "$TEMP/perimeter", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter.dta saved

. restore

. 
. 
. 
. preserve

. keep   id_agree   original

. gen  current = original
(68 missing values generated)

. drop if current ==""
(68 observations deleted)

. duplicates drop id_agree current, force  

Duplicates in terms of id_agree current

(0 observations are duplicates)

. 
. merge 1:1 id_agree current using "$TEMP/perimeter"
(variable current was str41, now str75 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,136
        from master                       961  (_merge==1)
        from using                        175  (_merge==2)

    Matched                             1,372  (_merge==3)
    -----------------------------------------

. drop _m 

.   
. save "$TEMP/perimeter", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter.dta saved

. restore

. 
. ********************************************************************************
. ********************************************************************************
. ********************************************************************************
. 
. use "$TEMP/perimeter", clear

. 
. duplicates drop id_agree current, force  

Duplicates in terms of id_agree current

(0 observations are duplicates)

. 
. merge m:1 id_agree   using "$TEMP/id_agree_perimeter"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             2,508  (_merge==3)
    -----------------------------------------

. drop _m 

. save "$TEMP/perimeter", replace   // 385 id_agree (15 inactive dropped)
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter.dta saved

. 
. unique id_agree
Number of unique values of id_agree is  385
Number of records is  2508

. 
. use "$TEMP/perimeter", clear

. 
. order id_agree agreement entry_force accession composition original current change_cty change_entry_time change_exit_time

. 
. 
.         gen EU_is_member =(current =="European Union")

. bys id_agree: egen temp  = max(EU_is_member)

.         replace EU_is_member = temp
(1,110 real changes made)

.         cap    drop temp

. 
. 
. ********************************************************************************
. ********************************************************************************
. * drop few coountries for which we have not entry/exit dates (does not mean we drop agreements still 384)
. 
. drop if     current != original & (change_entry_time == . & change_exit_time == .)  /*
> */                              & EU_is_member ==  0                                /*
> */                              & agreement != "AfCFTA (African Continental Free Trade) Agreement"
(7 observations deleted)

. 
. 
. cap drop EU_is_member

. 
. ********************************************************************************
. /*******************************************************************************
> ed if strpos(agreement, "East African Community (EAC)")
> ed if strpos(agreement, "Eurasian Economic Union (EAEU)")
> ed if strpos(agreement, "Southern African Development Community (SADC)")
> ed if strpos(agreement, "South Asian Free Trade Agreement (SAFTA)")
> ed if strpos(agreement, "Common Market for Eastern and Southern Africa (COMESA)")
> ed if strpos(agreement, "EFTA")
> ed if strpos(agreement, "Central American Common Market (CACM)")
> ed if strpos(agreement, "EU - Colombia, Ecuador and Peru")
> *******************************************************************************/
. ********************************************************************************
. *  Notice there are some double counting (accession and original): fix by hand
. 
. drop if change_cty =="Armenia"             & id_agree == 255 & accession =="No"
(1 observation deleted)

. drop if change_cty =="Kyrgyz Republic" & id_agree == 255 & accession =="No"
(1 observation deleted)

. 
. 
. drop if change_cty =="Seychelles"          & id_agree == 95  & accession =="No"
(1 observation deleted)

. drop if change_cty =="Afghanistan"         & id_agree == 136 & accession =="No"
(1 observation deleted)

. 
. 
. drop if change_cty =="Egypt"               & id_agree == 29  & accession =="No"
(1 observation deleted)

. drop if change_cty =="Seychelles"          & id_agree == 29  & accession =="No"
(0 observations deleted)

. drop if current    =="Seychelles"          & id_agree == 313  //  This is Egypt's accession to COMESA, which does not govern relations with Seychelles (see ab
> ove)
(1 observation deleted)

. 
. 
. drop if change_cty =="Iceland"             & id_agree == 2   & accession =="No"
(1 observation deleted)

. drop if change_cty =="Panama"              & id_agree == 3   & accession =="No"
(1 observation deleted)

. 
. 
. drop if change_cty =="Ecuador"             & id_agree == 229 & accession =="No"
(1 observation deleted)

. 
. 
. 
. ********************************************************************************
. ********************************************************************************
. * fix enlargement by hand this is much easier 
. 
. drop                                    if original   ==""   & id_agree == 1    // EU treaty only 6 country 
(22 observations deleted)

. 
. replace change_exit_time  =  1972       if  agreement=="EU Treaty"
(6 real changes made)

. replace change_exit_time  =  1980       if  agreement=="EC (9) Enlargement"
(9 real changes made)

. replace change_exit_time  =  1985       if  agreement=="EC (10) Enlargement"
(10 real changes made)

. replace change_exit_time  =  1994       if  agreement=="EC (12) Enlargement"
(12 real changes made)

. replace change_exit_time  =  2003       if  agreement=="EC (15) Enlargement"
(15 real changes made)

. replace change_exit_time  =  2006       if  agreement=="EC (25) Enlargement"
(25 real changes made)

. replace change_exit_time  =  2012       if  agreement=="EC (27) Enlargement"
(27 real changes made)

. replace change_exit_time  =  2999       if  agreement=="EU (28) Enlargement"
(28 real changes made)

. 
. 
. replace change_exit_time  =  2999           if change_exit_time == .
(2,253 real changes made)

. replace change_entry_time = entry_force if change_entry_time == .
(2,324 real changes made)

. 
. 
.  cap drop change_cty

.  
. rename change_entry_time cty_entry_time

. rename change_exit_time  cty_exit_time

. 
. 
. cap drop if current =="Falkland Islands (Islas Malvinas)"   // otherwise will mess up the reclink as it matches with Faroe Islands

. 
. // now we have a file with agreements list and members: problem sometimes memebers are agreements itself
. save "$TEMP/perimeter", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter.dta saved

. 
. ********************************************************************************
. /********************************************************************************
> Now we need to attache iso3 code to country names
> *******************************************************************************/
. ********************************************************************************
. 
. import excel "$dataset", sheet("Bilateral Information") firstrow allstring clear
(9 vars, 294,165 obs)

. 
. keep iso1 Economy1

. rename iso1     iso_o

. gen    iso_d =  iso_o

. rename Economy1 current

. duplicates drop

Duplicates in terms of all variables

(293,954 observations deleted)

. 
. 
. replace current = "South Korea"                                                 if current =="Korea, Rep." 
(1 real change made)

. replace current = "North Korea"                                                     if current =="Korea, Dem. People's Rep."
(1 real change made)

. replace current = "Aruba, the Netherlands with respect to"      if current == "Aruba"   
(1 real change made)

. replace current = "Bolivia, Plurinational State of"                     if current == "Bolivia"
(1 real change made)

. 
.  
. 
. expand 2   if current =="Congo, Rep."
(1 observation created)

. expand 4   if current =="Congo, Dem. Rep."
(3 observations created)

. 
. bys iso_o: gen obs = _n

. 
. replace  current ="Democratic Republic of the Congo" if iso_o =="COD" & obs == 2
(1 real change made)

. replace  current ="Congo"                                                        if iso_o =="COD" & obs == 3
(1 real change made)

. replace  current ="Democratic Republic of Congo"         if iso_o =="COD" & obs == 4
(1 real change made)

. 
. replace  current ="Republic of Congo"                            if iso_o =="COG" & obs == 2
(1 real change made)

. 
. ********************************************************************************
. 
. expand 2   if current =="South Korea"           
(1 observation created)

. cap drop obs 

. bys iso_o: gen obs = _n

. replace current = "Korea, Republic of"                           if  iso_o =="KOR" & obs == 2   
(1 real change made)

. 
. ********************************************************************************
. 
. expand 2   if current =="Iran, Islamic Rep."    
(1 observation created)

. cap drop obs 

. bys iso_o: gen obs = _n

. replace current = "Iran"                                                         if  iso_o =="IRN" & obs == 2   
(1 real change made)

. 
. ********************************************************************************
. 
. expand 3   if current =="Lao PDR"
(2 observations created)

. cap drop obs 

. bys iso_o: gen obs = _n

. 
. replace current = "Lao People's Democratic Republic" if iso_o =="LAO" & obs == 2
(1 real change made)

. replace current = "Laos"                                                         if iso_o =="LAO" & obs == 3
(1 real change made)

. 
. ********************************************************************************
. ********************************************************************************
. 
. replace current = "Palestine"                                            if current =="West Bank and Gaza" 
(1 real change made)

.  
. replace current = "Saint Lucia"                                          if current =="St. Lucia" 
(1 real change made)

. replace current = "Chinese Taipei"                                       if current == "Taiwan, China"
(1 real change made)

.  
. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. gen idu = _n

. 
. save "$TEMP/perimeter_cty_code", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_cty_code.dta saved

. 
. ********************************************************************************
. ********************************************************************************
. 
. 
. use "$TEMP/perimeter", clear

. 
. keep id_agree agreement current cty_entry_time cty_exit_time entry_force

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. gen idm = _n

. 
. reclink2 current using "$TEMP/perimeter_cty_code", gen(score) idm(idm) idu(idu)

2267 perfect matches found


Added: idu= identifier from /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_cty_code   score = matching 
> score
Observations:  Master N = 2469    /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_cty_code N= 219 
  Unique Master Cases: matched = 2364 (exact = 2267), unmatched = 105

. 
. 
. 
. 
. 
. 
. ********************************************************************************
. ********************************************************************************
. * save members that are actually agreements
. 
. gen list_matched    = 1                         if current =="European Free Trade Association (EFTA)"  | /*
> */                                                                         current =="European Union"                                              | /*
> */                                     current =="Southern Common Market (MERCOSUR)"       | /*
> */                                     current =="ASEAN Free Trade Area (AFTA)"                    | /*
> */                                     current =="Eurasian Economic Union (EAEU)"          | /*
> */                                     current =="Southern African Customs Union (SACU)"   | /*
> */                                     current =="Central American Common Market (CACM)"   | /*
> */                                     current =="Gulf Cooperation Council (GCC)"   
(2,372 missing values generated)

. 
. 
. ********************************************************************************
. ********************************************************************************
. *  save members country match
. preserve

. keep if _m == 3 | list_matched == 1
(8 observations deleted)

. keep id_agree agreement current cty_entry_time cty_exit_time entry_force iso_o iso_d

. save "$TEMP/rta_cty_code", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/rta_cty_code.dta saved

. restore

. 
. keep if list_matched == 1
(2,372 observations deleted)

. keep current  

. rename current agreement_member

. duplicates drop

Duplicates in terms of all variables

(89 observations deleted)

. save "$TEMP/rta_agree_code", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/rta_agree_code.dta saved

. 
. 
. ********************************************************************************
. ********************************************************************************
. * Retrieve the perimeter for members that are agreement 
. ********************************************************************************
. ********************************************************************************
. 
. 
. use "$TEMP/perimeter", clear

.  
. cap drop id_accession

. 
. 
. ********************************************************************************
. /*******************************************************************************
> GCC, MERCOSUR, SACU, ASEAN no variation in the perimeter but we need them
> as they appears as current members in some agreemet and we need to have the list of countries
> *******************************************************************************/
. ********************************************************************************
. gen  id_accession= 1     if accession =="Yes" |  strpos(agreement, "GCC") | strpos(agreement, "MERCOSUR") | strpos(agreement, "SACU") | strpos(agreement, "ASE
> AN") 
(2,023 missing values generated)

. 
. gen  agreement_accession    = agreement if id_accession== 1
(2,023 missing values generated)

.  
.  
.  
. replace agreement_accession =  "European Union"    if                  agreement=="EU Treaty"           |   agreement=="EC (9) Enlargement"  | /*
> */                                                                                                                         agreement=="EC (10) Enlargement" | 
>   agreement=="EC (12) Enlargement" | /*
> */                                                                     agreement=="EC (15) Enlargement" |   agreement=="EC (25) Enlargement" | /*
> */                                                                     agreement=="EC (27) Enlargement" |   agreement=="EU (28) Enlargement"
(132 real changes made)

. 
. 
. 
. replace agreement_accession = "European Free Trade Association (EFTA)" if strpos(agreement, "EFTA")        & id_accession== 1 
(8 real changes made)

. replace agreement_accession = "Eurasian Economic Union (EAEU)"         if strpos(agreement, "(EAEU)")      & id_accession== 1 
(9 real changes made)

. replace agreement_accession = "Central American Common Market (CACM)"  if strpos(agreement, "(CACM)")      & id_accession== 1 
(6 real changes made)

. 
. replace agreement_accession = "Gulf Cooperation Council (GCC)"         if strpos(agreement, "(GCC)")       & id_accession== 1 
(4 real changes made)

. replace agreement_accession = "Southern Common Market (MERCOSUR)"      if strpos(agreement, "(MERCOSUR)")  & id_accession== 1 
(11 real changes made)

. replace agreement_accession = "Southern African Customs Union (SACU)"  if strpos(agreement, "(SACU)")      & id_accession== 1 
(2 real changes made)

. replace agreement_accession = "ASEAN Free Trade Area (AFTA)"               if strpos(agreement, "ASEAN")           & id_accession== 1 
(35 real changes made)

. 
.  
. replace agreement_accession = subinstr(agreement_accession, "EU - ", "EU--", 1)
(130 real changes made)

. replace agreement_accession = subinstr(agreement_accession, "United Kingdom - ", "United Kingdom--", 1)
(11 real changes made)

. 
. split agreement_accession if id_accession== 1, parse(" - ") gen(accessed_cty)
variables created as string: 
accessed_c~1  accessed_c~2

. replace accessed_cty2       = subinstr(accessed_cty2, "Accession of ", "",  .)
(221 real changes made)

. 
. replace agreement_accession = accessed_cty1 if id_accession== 1
(221 real changes made)

. replace agreement_accession = agreement     if id_accession== . &  agreement_accession ==""
variable agreement_accession was str80 now str91
(2,017 real changes made)

. 
. replace agreement_accession = subinstr(agreement_accession, "EU--", "EU - " , 1)
(130 real changes made)

. replace agreement_accession = subinstr(agreement_accession, "United Kingdom--", "United Kingdom - " , 1)
(11 real changes made)

. 
. 
. sort  agreement_accession

. order id_accession id_agree agreement_accession entry_force

.  
. replace id_accession        =  0 if id_accession == .
(2,023 real changes made)

. bys agreement_accession: egen temp = max(id_accession)

.                 replace   id_accession     = temp
(152 real changes made)

. 
. keep if         id_accession    == 1    
(1,871 observations deleted)

. 
. ********************************************************************************
. ********************************************************************************
. * retain the original version of the agreement as no further accession are recorded 
. 
. drop if     strpos(agreement, "GCC")       & id_agree != 282 
(4 observations deleted)

. drop if     strpos(agreement, "MERCOSUR")  & id_agree != 21 
(11 observations deleted)

. drop if     strpos(agreement, "SACU")      & id_agree != 126 
(5 observations deleted)

. drop if     strpos(agreement, "ASEAN")     & id_agree != 295
(35 observations deleted)

. 
.   
. 
. ********************************************************************************
. /*******************************************************************************
> 
> below we identify country codes and perimeters of agreement when registered 
> members are agreements
> 
> *******************************************************************************/
. ********************************************************************************
. 
. order     cty_entry_time cty_exit_time current  agreement_accession

. keep      agreement_accession current cty_entry_time cty_exit_time 

. 
. rename agreement_accession agreement_member

. merge m:1 agreement_member using "$TEMP/rta_agree_code" 

    Result                      Number of obs
    -----------------------------------------
    Not matched                           353
        from master                       353  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               190  (_merge==3)
    -----------------------------------------

. keep if _m == 3
(353 observations deleted)

. cap drop _m 

.   
. 
. rename agreement_member signatory

. duplicates drop

Duplicates in terms of all variables

(4 observations deleted)

. 
. bys current signatory: egen min_y = min(cty_entry_time)

. bys current signatory: egen max_y = max(cty_exit_time)

. 
.                 replace cty_exit_time  = max_y
(104 real changes made)

. drop if cty_entry_time > min_y
(112 observations deleted)

. 
. cap drop *_y

. cap drop accession

. cap drop id_agree

. 
. 
. 
. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. gen idm = _n

. 
. reclink2 current using "$TEMP/perimeter_cty_code", gen(score) idm(idm) idu(idu)

70 perfect matches found


Added: idu= identifier from /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_cty_code   score = matching 
> score
Observations:  Master N = 74    /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_cty_code N= 219 
  Unique Master Cases: matched = 74 (exact = 70), unmatched = 0

. 
. 
. rename current   current_cty

. rename signatory current 

. 
. rename iso_o     iso_cty_o

. rename iso_d     iso_cty_d

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. 
. keep current current_cty cty_entry_time cty_exit_time iso_cty_o iso_cty_d

. rename cty_entry_time signatory_entry_time

. rename cty_exit_time  signatory_exit_time

. 
. save "$TEMP/perimeter_multilateral_agreements", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_multilateral_agreements.dta saved

. 
. ********************************************************************************
. ********************************************************************************
. 
. use "$TEMP/perimeter_multilateral_agreements", clear

. 
. preserve

. keep if current =="European Union"
(46 observations deleted)

. keep current iso_cty_o signatory_entry_time signatory_exit_time

. rename current multilateral

. rename iso_cty_o iso_o

. gen             iso_d = iso_o

. save "$TEMP/perimeter_european_union", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_european_union.dta saved

. restore

. 
. 
. 
. preserve

. keep if current=="ASEAN Free Trade Area (AFTA)"
(64 observations deleted)

. keep current iso_cty_o signatory_entry_time signatory_exit_time

. rename current multilateral

. rename iso_cty_o iso_o

. gen             iso_d = iso_o

. save "$TEMP/perimeter_asean", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_asean.dta saved

. restore

. 
. 
. 
. 
. preserve

. keep if current=="European Free Trade Association (EFTA)"
(64 observations deleted)

. keep current iso_cty_o signatory_entry_time signatory_exit_time

. rename current multilateral

. rename iso_cty_o iso_o

. gen             iso_d = iso_o

. save "$TEMP/perimeter_efta", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_efta.dta saved

. restore

. 
. // What about Angola listed as memer but there is a disclaimer in the WTO website
. use "$TEMP/rta_cty_code", clear

. keep if  strpos(agreement, "(COMESA)")
(2,404 observations deleted)

. bys iso_o: keep if _n == 1
(33 observations deleted)

. keep iso_o  cty_entry_time cty_exit_time

. 
. rename cty_entry_time   signatory_entry_time

. rename cty_exit_time    signatory_exit_time

. 
. gen  iso_d = iso_o

. save "$TEMP/perimeter_comesa", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_comesa.dta saved

. 
. 
. 
. ********************************************************************************
. /*******************************************************************************
> we know have a list of countries by agreement member and time of accession/leave
> *******************************************************************************/
. ********************************************************************************
. 
. use "$TEMP/rta_cty_code", clear

. 
. joinby current using "$TEMP/perimeter_multilateral_agreements", unmatched(both)

. 
. 
. *drop if  iso_cty_o     == "GBR"          & _m == 3 & id_agree == 285 
. * id_agree       285    agreement        EU - United Kingdom    entry_force 2021
. 
. 
. replace          iso_o = iso_cty_o                      if _m == 3
(1,786 real changes made)

. replace          iso_d = iso_cty_d                      if _m == 3
(1,786 real changes made)

. 
. replace cty_entry_time = signatory_entry_time   if _m == 3
(1,734 real changes made)

. replace cty_exit_time  = signatory_exit_time    if _m == 3
(174 real changes made)

. 
. replace cty_entry_time = 2008                   if _m == 3 & id_agree == 175 
(10 real changes made)

. * id_agree      agreement 175   ASEAN - Japan (this was ratified under the old ASEAN )
. 
. replace cty_entry_time = 2005                   if _m == 3 & id_agree == 106
(10 real changes made)

. * ASEAN - China id_agree 106
. 
. 
. 
. 
. gen          signatory = current

. replace           current  = current_cty                        if _m == 3
(1,786 real changes made)

. 
. 
.  
. 
. cap drop iso_cty_o

. cap drop iso_cty_d

. cap drop signatory_entry_time

. cap drop signatory_exit_time

. 
. cap drop current_cty

. 
. bys id_agree current: gen obs = _N

. 
. ********************************************************************************
. /*******************************************************************************
>  if more than one observation exists retain the observation where country appears as memeber
> *******************************************************************************/
. ********************************************************************************
. 
. drop if _m == 3  & obs > 1   // member states that signed in a different period than the overall agreement
(1,046 observations deleted)

. drop _m 

. 
. 
. drop if cty_exit_time == entry_force 
(5 observations deleted)

.   
.  
. 
. cap drop obs

. bys id_agree iso_o: gen obs = _N

. tab obs

        obs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,099      100.00      100.00
------------+-----------------------------------
      Total |      3,099      100.00

. 
. cap drop obs 

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. 
. save "$TEMP/perimeter_all_agreements", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_all_agreements.dta saved

. unique id_agree   // 385
Number of unique values of id_agree is  385
Number of records is  3099

. 
. order  id_agree entry_force agreement cty_entry_time cty_exit_time iso_o current signatory

. keep   id_agree entry_force agreement cty_entry_time cty_exit_time iso_o current signatory

. 
. rename signatory      signatory_o

. rename current        cty_o

. rename cty_exit_time  cty_exit_time_o

. rename cty_entry_time cty_entry_time_o

. 
. save "$TEMP/perimeter_all_agreements_o", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_all_agreements_o.dta saved

. 
. 
. rename signatory_o      signatory_d

. rename iso_o            iso_d

. rename cty_o            cty_d

. rename cty_exit_time_o  cty_exit_time_d

. rename cty_entry_time_o cty_entry_time_d

. 
. joinby id_agree entry_force agreement using "$TEMP/perimeter_all_agreements_o"

. 
. 
. order  id_agree entry_force agreement iso_o iso_d signatory_o signatory_d cty_o cty_d cty_entry_time_o cty_exit_time_o cty_entry_time_d cty_exit_time_d    

. 
. drop if iso_o == iso_d
(3,099 observations deleted)

. 
. drop if entry_force > cty_exit_time_o       // This is correct. Drop countries if the RTA is ratified after they leave the agreement
(1,828 observations deleted)

. drop if entry_force > cty_exit_time_d
(982 observations deleted)

. 
. save "$TEMP/perimeter_all_agreements_od", replace
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp/perimeter_all_agreements_od.dta saved

. 
. ********************************************************************************
. /*******************************************************************************
>  To avoid repetition, accession does not affect the inter-agreement relations:
>  
>  do this by hand this is better I think
>  
>  
> *******************************************************************************/
. ********************************************************************************
. use "$TEMP/perimeter_all_agreements_od", clear

. 
. gen id_eu = (id_agree == 1 | id_agree == 5 | id_agree == 13  | id_agree ==18  | id_agree == 28  | id_agree == 89  | id_agree == 117  | id_agree == 235 )

. 
. gen     bilateral_eu = 0

. replace bilateral_eu = 1    if strpos(agreement, "EU ")  
(42,914 real changes made)

. replace bilateral_eu = 1        if  (agreement =="European Economic Area (EEA)")
(930 real changes made)

. replace bilateral_eu = 0        if  strpos(agreement, "EAEU") 
(0 real changes made)

. 
. replace bilateral_eu = 0        if         id_eu == 1
(786 real changes made)

. replace bilateral_eu = 0        if  bilateral_eu == .
(0 real changes made)

. 
.  
. 
. /*******************************************************************************
>  signatory_exit_time >  entry_force: let UK out of EU agreements in 2019
>  signatory_exit_time >= entry_force: let UK in the EU agreements in 2019
> *******************************************************************************/
. 
. merge m:1 iso_o using "$TEMP/perimeter_european_union", keepusing(iso_o signatory_*)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        14,658
        from master                    14,658  (_merge==1)
        from using                          0  (_merge==2)

    Matched                            42,476  (_merge==3)
    -----------------------------------------

. *     gen  eu_o  =(_m==3  & signatory_entry_time <= entry_force &  signatory_exit_time >=  entry_force & signatory_entry_time != . & signatory_exit_time != .)
>   
. // this was wrong, no matter when a country join EU bilateral agreement should not affect intra eu relations
.       gen     eu_o  =(_m==3)

.           replace eu_o  = 0   if iso_o =="GBR" & entry_force > 2019  // starting from 2020 GBR no longer EU
(104 real changes made)

.  
.           drop _m 

. cap drop signatory_*

. 
. merge m:1 iso_d using "$TEMP\perimeter_european_union", keepusing(iso_d signatory_*)
file /Users/anthoninlevelu/Desktop/World Bank/2024/PTA_project/FLRS/WB_DTA_Toolkit_dev/1.data/temp\perimeter_european_union.dta not found
r(601);

end of do-file
r(601);

end of do-file
r(601);

end of do-file

r(601);

. do "/var/folders/78/3fbqqz4j45sckg41vqsfrscm0000gn/T//SD51849.000000"

. do "$PROG_dta/p0_read_DTA.do"

. ********************************************************************************
. ********************************************************************************
. ********************************************************************************
. 
. 
. cap     log close
